{
  "id": 747,
  "date": "2021-11-18T17:20:31",
  "date_gmt": "2021-11-18T17:20:31",
  "guid": {
    "rendered": "https:\/\/anslegal.in\/wsu\/?page_id=747"
  },
  "modified": "2021-11-18T17:20:32",
  "modified_gmt": "2021-11-18T17:20:32",
  "slug": "machine-learning-applications-based",
  "status": "publish",
  "type": "page",
  "link": "https:\/\/anslegal.in\/wsu\/machine-learning-applications-based\/",
  "title": {
    "rendered": "Machine Learning Applications based"
  },
  "content": {
    "rendered": "\n<ol><li>The paper proposes off-line training based on artificial neural networks to compute the Voltage stability Indices in real time. (<a href=\"http:\/\/ieeexplore.ieee.org\/document\/7584137\/\">http:\/\/ieeexplore.ieee.org\/document\/7584137\/<\/a>)<\/li><li><a href=\"https:\/\/www.researchgate.net\/profile\/Alexandre_Anzai\/publication\/261021676_Real_time_voltage_stability_margin_estimation_using_auto-regressive_models_and_PMUs\/links\/00463527cdea9394c7000000\/Real-time-voltage-stability-margin-estimation-using-auto-regressive-models-and-PMUs.pdf\"><\/a>Real time voltage stability margin estimation using auto regressive models and PMUs. (<a href=\"https:\/\/www.researchgate.net\/profile\/Alexandre_Anzai\/publication\/261021676_Real_time_voltage_stability_margin_estimation_using_auto-regressive_models_and_PMUs\/links\/00463527cdea9394c7000000\/Real-time-voltage-stability-margin-estimation-using-auto-regressive-models-and-PMUs.pdf\">Reserach Gate<\/a>)<\/li><li>Authors present an artificial neural network based approach that is able to successfully estimate Voltage stability margin under both normal and N-1 contingency scenarios. The authors show that voltage magnitudes and phase angles are best indicators of voltage stability margin. Authors also present a suboptimal approach for placement of PMUs. (<a href=\"https:\/\/ieeexplore.ieee.org\/document\/5405083\">https:\/\/ieeexplore.ieee.org\/document\/5405083<\/a>)<\/li><li>This paper presents a voltage security assessment scheme using synchrophasor data which is based on decision trees. Decision trees are trained off-line based on past and day ahead predicted operating conditions. Decision trees are updated hourly in the proposed approach. Ultimately in the online mode attributes from PMU measurements are used to access voltage security. (<a href=\"https:\/\/ieeexplore.ieee.org\/document\/4813188\">https:\/\/ieeexplore.ieee.org\/document\/4813188<\/a>)<\/li><li>This paper proposes a Genetic Algorithm based support vector machine approach for online voltage stability monitoring. Once trained offline the algorithm takes PMU data in form of Bus phase angles and magnitudes to compute a vector voltage stability indices for whole system. (<a href=\"https:\/\/www.sciencedirect.com\/science\/article\/pii\/S0142061514005213\">https:\/\/www.sciencedirect.com\/science\/article\/pii\/S0142061514005213<\/a>)<\/li><li>This paper presents a DT based approach coupled with Principal component analysis for voltage security assessment. Authors show that because of large number of features DTs might not be suitable for online implementation. Authors use PCA and correlation analysis for dimensionality reduction which leads to efficient selection and extraction of features for Voltage stability assessment. (<a href=\"https:\/\/ieeexplore.ieee.org\/document\/6331026\">https:\/\/ieeexplore.ieee.org\/document\/6331026<\/a>)<\/li><li>In this paper a regression tree based approach to predicting power system voltage stability margin has been proposed by authors. Input features are voltage and current phasors from PMUs. CPF and modal analysis generate Training knowledge base. Metrics for assessment are damping ratio of most critical mode and MW margin. Robustness against measurement errors and topology variation is also analyzed. (<a href=\"https:\/\/ieeexplore.ieee.org\/document\/6331026\">https:\/\/ieeexplore.ieee.org\/document\/6331026<\/a>)<\/li><li>In this paper a novel integrated scheme based on relationships exploration concept is proposed for voltage stability margin monitoring. In the proposed approach optimal features are selected based on statistical scores and then used for computation of voltage stability margin. (<a href=\"https:\/\/ieeexplore.ieee.org\/document\/6883220\">https:\/\/ieeexplore.ieee.org\/document\/6883220<\/a>)<\/li><li>This thesis a decision tree based approach for voltage stability monitoring. The proposed approach utilizes the relationship between bus voltage angle separation and network stress. Author also shows that proposed approach works similar to monitoring of generator VAR production as metric for monitoring voltage stability. (<a href=\"https:\/\/vtechworks.lib.vt.edu\/bitstream\/handle\/10919\/28266\/rnuqui_dissertation.pdf?sequence=1&amp;isAllowed=y\">https:\/\/vtechworks.lib.vt.edu\/bitstream\/handle\/10919\/28266\/rnuqui_dissertation.pdf?sequence=1&amp;isAllowed=y<\/a>)<\/li><li>The decision tree architecture is trained using offline continuation power flow simulations. Authors show that widening bus voltage angle differences and transmission line reactive power flows constitute the best attributes for voltage security monitoring. (<a href=\"https:\/\/ieeexplore.ieee.org\/document\/1372874\">https:\/\/ieeexplore.ieee.org\/document\/1372874<\/a>)<\/li><li>This paper presents an adaptive load shedding scheme in power system under critical contingencies which can result in frequency or voltage instability. Paper presents assessment voltage stability assessment based on a dynamic voltage stability criterion. This assessment comes in form of voltage stability risk indicator which is used in decision regarding load shedding. (<a href=\"http:\/\/ieeexplore.ieee.org\/document\/5734886\/\">http:\/\/ieeexplore.ieee.org\/document\/5734886\/<\/a>)<\/li><li>Paper presents a voltage stability monitoring application based on the concept of artificial networks. Training of ANN is done using wide area phasor measurements from PMUS. Feature reduction techniques are also considered to ensure selection of most important features. (<a href=\"https:\/\/ieeexplore.ieee.org\/document\/4523542\">https:\/\/ieeexplore.ieee.org\/document\/4523542<\/a>)<\/li><li>A decision tree based approach with voltage phase angles and generator VAR production as features for voltage stability monitoring is presented. Both these indicators are shown to be suitable indicators of voltage stability problems. A PMU placement algorithm is also considered. (<a href=\"https:\/\/ieeexplore.ieee.org\/document\/917282\">https:\/\/ieeexplore.ieee.org\/document\/917282<\/a>)<\/li><li>This paper presents a method for PMU based Small Signal Voltage Stability monitoring in real time. AR-method is used to predict voltage which is different from traditional approach which uses full power system model. (<a href=\"https:\/\/ieeexplore.ieee.org\/document\/1547097\">https:\/\/ieeexplore.ieee.org\/document\/1547097<\/a>)<\/li><li><a href=\"https:\/\/www.sciencedirect.com\/science\/article\/pii\/S1877705815021098?via%3Dihub\">https:\/\/www.sciencedirect.com\/science\/article\/pii\/S1877705815021098?via%3Dihub<\/a><\/li><\/ol>\n",
    "protected": false
  },
  "excerpt": {
    "rendered": "<p>The paper proposes off-line training based on artificial neural networks to compute the Voltage stability Indices in real time. (http:\/\/ieeexplore.ieee.org\/document\/7584137\/) Real time voltage stability margin estimation using auto regressive models and PMUs. (Reserach Gate) Authors present an artificial neural network based approach that is able to successfully estimate Voltage stability margin under both normal and&hellip; <a class=\"more-link\" href=\"https:\/\/anslegal.in\/wsu\/machine-learning-applications-based\/\">Continue reading <span class=\"screen-reader-text\">Machine Learning Applications based<\/span><\/a><\/p>\n",
    "protected": false
  },
  "author": 1,
  "featured_media": 0,
  "parent": 0,
  "menu_order": 0,
  "comment_status": "closed",
  "ping_status": "closed",
  "template": "tamplate_one.php",
  "meta": [],
  "_links": {
    "self": [
      {
        "href": "https:\/\/anslegal.in\/wsu\/wp-json\/wp\/v2\/pages\/747"
      }
    ],
    "collection": [
      {
        "href": "https:\/\/anslegal.in\/wsu\/wp-json\/wp\/v2\/pages"
      }
    ],
    "about": [
      {
        "href": "https:\/\/anslegal.in\/wsu\/wp-json\/wp\/v2\/types\/page"
      }
    ],
    "author": [
      {
        "embeddable": true,
        "href": "https:\/\/anslegal.in\/wsu\/wp-json\/wp\/v2\/users\/1"
      }
    ],
    "replies": [
      {
        "embeddable": true,
        "href": "https:\/\/anslegal.in\/wsu\/wp-json\/wp\/v2\/comments?post=747"
      }
    ],
    "version-history": [
      {
        "count": 1,
        "href": "https:\/\/anslegal.in\/wsu\/wp-json\/wp\/v2\/pages\/747\/revisions"
      }
    ],
    "predecessor-version": [
      {
        "id": 748,
        "href": "https:\/\/anslegal.in\/wsu\/wp-json\/wp\/v2\/pages\/747\/revisions\/748"
      }
    ],
    "wp:attachment": [
      {
        "href": "https:\/\/anslegal.in\/wsu\/wp-json\/wp\/v2\/media?parent=747"
      }
    ],
    "curies": [
      {
        "name": "wp",
        "href": "https:\/\/api.w.org\/{rel}",
        "templated": true
      }
    ]
  }
}