{
  "id": 757,
  "date": "2021-11-18T17:23:03",
  "date_gmt": "2021-11-18T17:23:03",
  "guid": {
    "rendered": "https:\/\/anslegal.in\/wsu\/?page_id=757"
  },
  "modified": "2021-11-18T17:23:04",
  "modified_gmt": "2021-11-18T17:23:04",
  "slug": "region-equivalent-based-schemes-2",
  "status": "publish",
  "type": "page",
  "link": "https:\/\/anslegal.in\/wsu\/region-equivalent-based-schemes-2\/",
  "title": {
    "rendered": "Region Equivalent Based Schemes"
  },
  "content": {
    "rendered": "\n<h2>Thevenin based<\/h2>\n\n\n\n<ol><li>Local voltage stability PMU based algorithm. It calculates thevenin equivalent impedance as the measure of voltage stability. Based on the concept of VIP (Voltage Instability Predictor). Proposes robust recursive least squares estimation to eliminate impacts of PMU measurement errors. (<a href=\"http:\/\/ieeexplore.ieee.org\/document\/7484311\/\">http:\/\/ieeexplore.ieee.org\/document\/7484311\/<\/a>)<\/li><li>The method is based on iteration free estimation of Thevenin parameters and computation of VSAI based on the estimated parameters. The main contribution of the proposed method is that it doesn’t make assumptions normally made in VIP based approaches. (<a href=\"http:\/\/ieeexplore.ieee.org\/document\/6629377\/\">http:\/\/ieeexplore.ieee.org\/document\/6629377\/<\/a>)<\/li><li>This paper uses phasor measurements to compute thevenin parameters. Kalman filter based technique is used to compute the thevenin parameters. This paper also uses phasor measurements to identify load parameters (exponential model of load). (<a href=\"http:\/\/ieeexplore.ieee.org\/document\/6180569\/\">http:\/\/ieeexplore.ieee.org\/document\/6180569\/<\/a>)<\/li><li>This paper is based on using local phasor measurements to adaptively track the thevenin equivalents to compute voltage stability index. (<a href=\"http:\/\/ieeexplore.ieee.org\/document\/4512044\/\">http:\/\/ieeexplore.ieee.org\/document\/4512044\/<\/a>)<\/li><li><strong>Sub Category : Impact of Uncertainty in PMU Measurements<\/strong>&nbsp;This paper experimentally characterizes the relation between phase and magnitude error from PMUs in steady state and study its effect on realtime computation of voltage stability indices. Authors through their experimentation show that taking correlation between phase and magnitude errors results in better accuracy with regards to computation of voltage stability indices. (<a href=\"http:\/\/ieeexplore.ieee.org\/document\/7232772\/\">http:\/\/ieeexplore.ieee.org\/document\/7232772\/<\/a>,&nbsp;<a href=\"http:\/\/ieeexplore.ieee.org\/document\/6913573\/\">http:\/\/ieeexplore.ieee.org\/document\/6913573\/<\/a>)<\/li><li>Least Squares and Kalman filter based: This paper proposes hybrid least squares and Kalman filter based estimation for Thevenin parameters. Main contribution is proposing hybrid estimation such that estimation method responds well to step changes (Kalman filter) in load and also gives a small margin near collapse (Least squares): (<a href=\"http:\/\/ieeexplore.ieee.org\/document\/7286476\/\">http:\/\/ieeexplore.ieee.org\/document\/7286476\/<\/a>)<\/li><li>The paper discusses results of implementation of Voltage instability predictor based monitoring algorithm in RES521 (ABB) to monitor voltage instability associated with transfer across a corridor from Norway to Sweden. (<a href=\"https:\/\/ieeexplore.ieee.org\/document\/1397539\">https:\/\/ieeexplore.ieee.org\/document\/1397539<\/a>)<\/li><li>This paper further investigates the previous approach presented by same authors regarding local PMU measurement based estimation of Thevenin parameters and their use to monitor voltage stability. (<a href=\"https:\/\/ieeexplore.ieee.org\/document\/6629381\">https:\/\/ieeexplore.ieee.org\/document\/6629381<\/a>)<\/li><li>In this paper authors use 3 consecutive PMU measurements for robust estimation of Thevenin parameters. Authors add robustness to phase drifts caused by measurement slip frequency. Corrected and synchronized phase angles are then used for Thevenin parameter estimation. (<a href=\"http:\/\/ieeexplore.ieee.org\/document\/6132444\/\">http:\/\/ieeexplore.ieee.org\/document\/6132444\/<\/a>)<\/li><li>Paper presents a cubic spline based method for estimation of Real time Voltage stability margin. Thevenin parameters are estimated using three measurements by the cubic spline extrapolation and power margins are calculated based on computed parameters. Load trends are also taken into account by the authors. (<a href=\"https:\/\/ieeexplore.ieee.org\/document\/6344721\">https:\/\/ieeexplore.ieee.org\/document\/6344721<\/a>)<\/li><li><a href=\"http:\/\/www.coep.ufrj.br\/~tarang\/CIGRE2008.doc\">www.coep.ufrj.br\/~tarang\/CIGRE2008.doc<\/a><\/li><li>This paper investigates the impact of PMU accuracy on estimation of Thevenin parameters and the computed voltage stability indices. Authors study the distribution parameters i-e mean and standard deviation of voltage stability indices. (<a href=\"https:\/\/ieeexplore.ieee.org\/document\/7028910\">https:\/\/ieeexplore.ieee.org\/document\/7028910<\/a>)<\/li><li>This paper proposed enhancements for Thevenin based voltage stability assessment. Grid transmission coefficients are evaluated to find wide area information. The authors propose using study of generator emf to gather wide area information which is done by using Grid transmission coefficients. (<a href=\"https:\/\/ieeexplore.ieee.org\/document\/7028805\">https:\/\/ieeexplore.ieee.org\/document\/7028805<\/a>)<\/li><li>In this paper authors analyze the impact of synchrophasor measurement accuracy on simple voltage stability application. The authors consider this a first step to define performance characteristics of synchrophasor measurements and enhancing robustness of voltage stability applications to PMU uncertainty. (<a href=\"https:\/\/ieeexplore.ieee.org\/document\/5944290\/\">https:\/\/ieeexplore.ieee.org\/document\/5944290\/<\/a>)<\/li><\/ol>\n\n\n\n<h2>Other Approaches<\/h2>\n\n\n\n<ol><li>Authors develop a new voltage stability monitoring algorithm based on local phasor measurements. The algorithm formulation is based on the concept that in the vicinity of collapse the major chunk of power from sending end is consumed by losses such that near collapse point there is negligible change in apparent power at receiving end. The authors further use this concept to come up with a protection algorithm which is implementable in a numeric relay. (<a href=\"https:\/\/ieeexplore.ieee.org\/document\/1043669\/\">https:\/\/ieeexplore.ieee.org\/document\/1043669\/<\/a>)<\/li><\/ol>\n\n\n\n<h2>Area based<\/h2>\n\n\n\n<ol><li>This paper develops a three-bus equivalent for measurement based voltage stability monitoring for load area supplied from remote generating station via multiple tie-lines. Authors demonstrate that approach is able to identify maximum power transfer limit more accurately for individual tie-lines which Thevenin based approach is not capable of doing. (<a href=\"http:\/\/ieeexplore.ieee.org\/document\/6939177\/\">http:\/\/ieeexplore.ieee.org\/document\/6939177\/<\/a>)<\/li><li>This paper proposes measurement based voltage stability algorithm for a load area fed by N-tie lines. The method is based on development of N+1 Bus equivalent for a load area fed by N-tie lines. Authors demonstrate that their proposed method performs better than Thevenin based method by measuring power transfer limit for individual tie lines which Thevenin based method is not capable of doing. (<a href=\"https:\/\/ieeexplore.ieee.org\/document\/7273986\/\">https:\/\/ieeexplore.ieee.org\/document\/7273986\/<\/a>)<\/li><li>In this paper authors propose two simple equivalent network modeling methods for multiple infeed load centers. The equivalents are updated using PMU measurements at the load center and then used for plotting PV curves and predicting margin to point of collapse. (<a href=\"https:\/\/ieeexplore.ieee.org\/document\/4075932\/\">https:\/\/ieeexplore.ieee.org\/document\/4075932\/<\/a>)<\/li><li>In this paper authors extend their previous work of modeling power transfer interface using only one generator. In this work multiple injections that share power transfer are modelled. Modified AQ Bus approach introduced by same authors is used to compute steady state margins. (<a href=\"https:\/\/ieeexplore.ieee.org\/document\/7038431\/\">https:\/\/ieeexplore.ieee.org\/document\/7038431\/<\/a>)<\/li><li>This paper presents a novel approach to estimate voltage stability margin in realtime for monitored load areas fed by multiple transmission lines. The presented approach is able to provide real and reactive margins for monitored individual tie lines. (<a href=\"https:\/\/ieeexplore.ieee.org\/document\/6873795\/\">https:\/\/ieeexplore.ieee.org\/document\/6873795\/<\/a>)<\/li><li>In this paper authors have proposed an approach to define voltage across area by combining voltages of the boundary buses. Authors also highlight application of the proposed equivalencing approach for enhanced monitoring of system stress and network reduction. (<a href=\"http:\/\/ieeexplore.ieee.org\/document\/6075306\/\">http:\/\/ieeexplore.ieee.org\/document\/6075306\/<\/a>)<\/li><\/ol>\n\n\n\n<h2>Corridor based<\/h2>\n\n\n\n<ol><li>Proposes a method for PMU based real time transmission corridor voltage stability. Proposed approach requires placement of PMUs on both sides of the corridor. Main contribution of this paper is construction of equivalent network for corridor using a single set of PMU Measurements. Estimation is split into two stages: determination of T-equivalent, determination of Thevenin parameters. The proposed approach avoids the time delay associated with traditional VIP schemes. (<a href=\"https:\/\/www.sciencedirect.com\/science\/article\/pii\/S1474667017344373\">https:\/\/www.sciencedirect.com\/science\/article\/pii\/S1474667017344373<\/a>)<\/li><li>This paper proposes a new method to model equivalent network for corridor voltage stability analysis. The proposed equivalent retains all transmission lines and is more detailed than Thevenin equivalent model. (<a href=\"http:\/\/ieeexplore.ieee.org\/document\/4523701\/\">http:\/\/ieeexplore.ieee.org\/document\/4523701\/<\/a>)<\/li><li>This paper presents a novel approach to fast voltage stability monitoring of transmission corridors by using measurements on both ends of the corridor. Area based reduction is proposed which can deal with multiple transmission lines. Authors also identify the ideal conditions in which reduced equivalent works perfectly. (<a href=\"http:\/\/ieeexplore.ieee.org\/document\/6938974\/\">http:\/\/ieeexplore.ieee.org\/document\/6938974\/<\/a>)<\/li><li>This thesis presents two novel methodologies for realtime voltage stability of transmission corridors which is independent of state estimator and relies solely on synchrophasor measurements. First reduction approach is based on conservation of voltage across the area and second approach is based on preservation of complex power flowing through the corridor. (<a href=\"https:\/\/lib.dr.iastate.edu\/etd\/15999\/\">https:\/\/lib.dr.iastate.edu\/etd\/15999\/<\/a>)<\/li><li>In this letter authors present a common base for 3 network reduction approaches for realtime voltage stability analysis of transmission corridors. REI, Area and complex power based transmission corridor equivalents are presented and analyzed for a simple network. (<a href=\"http:\/\/ieeexplore.ieee.org\/document\/7153568\/\">http:\/\/ieeexplore.ieee.org\/document\/7153568\/<\/a>)<\/li><li>In this paper authors propose an equivalent for transmission corridor with multiple lines based on complex power flowing through the corridor. The equivalent preserves the current and complex power flowing through the corridor and can deal with accommodation of generato reactive power limits. (<a href=\"http:\/\/ieeexplore.ieee.org\/document\/7286215\/\">http:\/\/ieeexplore.ieee.org\/document\/7286215\/<\/a>)<\/li><\/ol>\n",
    "protected": false
  },
  "excerpt": {
    "rendered": "<p>Thevenin based Local voltage stability PMU based algorithm. It calculates thevenin equivalent impedance as the measure of voltage stability. Based on the concept of VIP (Voltage Instability Predictor). Proposes robust recursive least squares estimation to eliminate impacts of PMU measurement errors. (http:\/\/ieeexplore.ieee.org\/document\/7484311\/) The method is based on iteration free estimation of Thevenin parameters and computation&hellip; <a class=\"more-link\" href=\"https:\/\/anslegal.in\/wsu\/region-equivalent-based-schemes-2\/\">Continue reading <span class=\"screen-reader-text\">Region Equivalent Based Schemes<\/span><\/a><\/p>\n",
    "protected": false
  },
  "author": 1,
  "featured_media": 0,
  "parent": 0,
  "menu_order": 0,
  "comment_status": "closed",
  "ping_status": "closed",
  "template": "",
  "meta": [],
  "_links": {
    "self": [
      {
        "href": "https:\/\/anslegal.in\/wsu\/wp-json\/wp\/v2\/pages\/757"
      }
    ],
    "collection": [
      {
        "href": "https:\/\/anslegal.in\/wsu\/wp-json\/wp\/v2\/pages"
      }
    ],
    "about": [
      {
        "href": "https:\/\/anslegal.in\/wsu\/wp-json\/wp\/v2\/types\/page"
      }
    ],
    "author": [
      {
        "embeddable": true,
        "href": "https:\/\/anslegal.in\/wsu\/wp-json\/wp\/v2\/users\/1"
      }
    ],
    "replies": [
      {
        "embeddable": true,
        "href": "https:\/\/anslegal.in\/wsu\/wp-json\/wp\/v2\/comments?post=757"
      }
    ],
    "version-history": [
      {
        "count": 1,
        "href": "https:\/\/anslegal.in\/wsu\/wp-json\/wp\/v2\/pages\/757\/revisions"
      }
    ],
    "predecessor-version": [
      {
        "id": 758,
        "href": "https:\/\/anslegal.in\/wsu\/wp-json\/wp\/v2\/pages\/757\/revisions\/758"
      }
    ],
    "wp:attachment": [
      {
        "href": "https:\/\/anslegal.in\/wsu\/wp-json\/wp\/v2\/media?parent=757"
      }
    ],
    "curies": [
      {
        "name": "wp",
        "href": "https:\/\/api.w.org\/{rel}",
        "templated": true
      }
    ]
  }
}